{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3c6cbceb",
   "metadata": {},
   "source": [
    "#\n",
    "## NsPM data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "03c2d26e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['data1249.sparql',\n",
       " 'final_paraphrased_templates',\n",
       " 'data.sparql',\n",
       " 'data1249.en',\n",
       " 'data.en',\n",
       " 'drive-download-20230727T150544Z-001.zip']"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "\n",
    "data_path = \"/home/mehrzad/repos/mehrz/dbpedia/data/data-saurav/\"\n",
    "\n",
    "os.listdir(data_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bcd14976",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "How many floor area did tempe marketplace have ?\n",
      "How many floor area did robert thomson building have ?\n",
      "How many floor area did kingsway mall have ?\n",
      "How many floor area did sm city rosario have ?\n",
      "How many floor area did 1000 second avenue have ?\n",
      "How many floor area did spectrum have ?\n",
      "How many floor area did headquarters of the federal intelligence service have ?\n",
      "How many floor area did house of awakened culture have ?\n",
      "How many floor area did tiaa bank center have ?\n",
      "How many floor area did liberty center have ?\n"
     ]
    }
   ],
   "source": [
    "with open(os.path.join(data_path, \"data1249.en\"), 'r') as file:\n",
    "    for i,line in enumerate(file):\n",
    "        print(line.strip()) if i<10 else None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "397bf0b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Tempe_Marketplace dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Robert_Thomson_Building dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Kingsway_Mall dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_SM_City_Rosario dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_1000_Second_Avenue dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Spectrum,_Bristol dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Headquarters_of_the_Federal_Intelligence_Service dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_House_of_Awakened_Culture dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_TIAA_Bank_Center dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Liberty_Center_(mall) dbo_floorArea var_x brack_close\n"
     ]
    }
   ],
   "source": [
    "with open(os.path.join(data_path, \"data1249.sparql\"), 'r') as file:\n",
    "    for i,line in enumerate(file):\n",
    "        print(line.strip()) if i<10 else None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3ca25158",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314893</th>\n",
       "      <td>Is frank e. bauer bridge length of minnesota s...</td>\n",
       "      <td>ask where{dbr:Minnesota_State_Highway_267 dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314894</th>\n",
       "      <td>Is prudential tunnel length of ben sawyer brid...</td>\n",
       "      <td>ask where{dbr:Ben_Sawyer_Bridge dbo:length dbr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314895</th>\n",
       "      <td>Is river suir bridge length of mckinley bridge ?</td>\n",
       "      <td>ask where{dbr:McKinley_Bridge dbo:length dbr:R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314896</th>\n",
       "      <td>Is mckinley washington jr. bridge length of ch...</td>\n",
       "      <td>ask where{dbr:Chūō_Expressway dbo:length dbr:M...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314897</th>\n",
       "      <td>Is saltstraumen bridge length of saskatchewan ...</td>\n",
       "      <td>ask where{dbr:Saskatchewan_Highway_904 dbo:len...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>314898 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              nl_question  \\\n",
       "0        How many floor area did tempe marketplace have ?   \n",
       "1       How many floor area did robert thomson buildin...   \n",
       "2            How many floor area did kingsway mall have ?   \n",
       "3          How many floor area did sm city rosario have ?   \n",
       "4       How many floor area did 1000 second avenue have ?   \n",
       "...                                                   ...   \n",
       "314893  Is frank e. bauer bridge length of minnesota s...   \n",
       "314894  Is prudential tunnel length of ben sawyer brid...   \n",
       "314895   Is river suir bridge length of mckinley bridge ?   \n",
       "314896  Is mckinley washington jr. bridge length of ch...   \n",
       "314897  Is saltstraumen bridge length of saskatchewan ...   \n",
       "\n",
       "                                             sparql_query  \n",
       "0       select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1       select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2       select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3       select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4       select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                   ...  \n",
       "314893  ask where{dbr:Minnesota_State_Highway_267 dbo:...  \n",
       "314894  ask where{dbr:Ben_Sawyer_Bridge dbo:length dbr...  \n",
       "314895  ask where{dbr:McKinley_Bridge dbo:length dbr:R...  \n",
       "314896  ask where{dbr:Chūō_Expressway dbo:length dbr:M...  \n",
       "314897  ask where{dbr:Saskatchewan_Highway_904 dbo:len...  \n",
       "\n",
       "[314898 rows x 2 columns]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# import sys\n",
    "# sys.path.append('/home/mehrzad/repos/mehrz/dbpedia/neural-qa-mehrzadshm')\n",
    "# from nspm import generator_utils\n",
    "# import pandas as pd\n",
    "\n",
    "\n",
    "# with open(\n",
    "#     os.path.join(data_path, \"data1249.en\"), 'r'\n",
    "# ) as file1, open(\n",
    "#     os.path.join(data_path, \"data1249.sparql\"), 'r'\n",
    "# ) as file2:\n",
    "#     lines_nl = file1.readlines()\n",
    "#     lines_sparql = file2.readlines()\n",
    "    \n",
    "\n",
    "    \n",
    "# # decode sparql statements to standard format using generator_utils.decode()     \n",
    "# lines_sparql = [generator_utils.decode(line) for line in lines_sparql]\n",
    "\n",
    "\n",
    "# df = pd.DataFrame({\n",
    "#     'nl_question':lines_nl,\n",
    "#     'sparql_query':lines_sparql\n",
    "# })\n",
    "\n",
    "\n",
    "# df['nl_question'] = df['nl_question'].str.strip()\n",
    "# df['sparql_query'] = df['sparql_query'].str.strip()\n",
    "\n",
    "# df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "fe4a2da7",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 235481:\n",
      "NL=What is the rebuilding year of tai wai station ?\n",
      "SPARQL=select ?x where{dbr:Tai_Wai_station dbo:rebuildingYear ?x }\n",
      "\n",
      "Row 154910:\n",
      "NL=What was the significant project of loudoun house's architect ?\n",
      "SPARQL=select ?x where{dbr:Loudoun_House dbo:architect ?x1 . ?x1 dbo:significantProject ?x }\n",
      "\n",
      "Row 93671:\n",
      "NL=Which route did aqua line have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Aqua_Line_(Pune_Metro) dbo:routeStart ?x }\n",
      "\n",
      "Row 62059:\n",
      "NL=What are the suites in the westin grand ?\n",
      "SPARQL=select count(*) as ?x where{dbr:The_Westin_Grand,_Vancouver dbo:numberOfSuites ?x }\n",
      "\n",
      "Row 38691:\n",
      "NL=What is the installed capacity of greifswald power station ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Greifswald_Power_Station dbo:installedCapacity ?x }\n",
      "\n",
      "Row 185766:\n",
      "NL=What is valhalla station fare zone ?\n",
      "SPARQL=select ?x where{dbr:Valhalla_station dbo:fareZone ?x }\n",
      "\n",
      "Row 131905:\n",
      "NL=How long is corby bridge ?\n",
      "SPARQL=select ?x where{dbr:Corby_Bridge dbo:length ?x }\n",
      "\n",
      "Row 138234:\n",
      "NL=What is the birth name of the percival molson memorial stadium's architect ?\n",
      "SPARQL=select ?x where{dbr:Percival_Molson_Memorial_Stadium dbo:architect ?x1 . ?x1 dbo:birthName ?x }\n",
      "\n",
      "Row 245281:\n",
      "NL=What is the parking information of joondalup line's route end ?\n",
      "SPARQL=select ?x where{dbr:Joondalup_line dbo:routeEnd ?x1 . ?x1 dbo:parkingInformation ?x }\n",
      "\n",
      "Row 34015:\n",
      "NL=How many chef did saint pierre have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Saint_Pierre_(restaurant) dbo:headChef ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# random pairs of NL question and SPARQL queries\n",
    "for index, row in df.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "4bf6d612",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td>How many promotions did caravana de campeones ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td>How many promotions did glory by honor xv achi...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td>How many promotions did against all odds achie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td>How many promotions did wrestlemania 21 achieve ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td>How many promotions did hiroshima goddess fest...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               nl_question  \\\n",
       "0         How many floor area did tempe marketplace have ?   \n",
       "1        How many floor area did robert thomson buildin...   \n",
       "2             How many floor area did kingsway mall have ?   \n",
       "3           How many floor area did sm city rosario have ?   \n",
       "4        How many floor area did 1000 second avenue have ?   \n",
       "...                                                    ...   \n",
       "7779525  How many promotions did caravana de campeones ...   \n",
       "7779526  How many promotions did glory by honor xv achi...   \n",
       "7779527  How many promotions did against all odds achie...   \n",
       "7779528  How many promotions did wrestlemania 21 achieve ?   \n",
       "7779529  How many promotions did hiroshima goddess fest...   \n",
       "\n",
       "                                              sparql_query  \n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                    ...  \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...  \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...  \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...  \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...  \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with open(\n",
    "    os.path.join(data_path, \"data.en\"), 'r'\n",
    ") as file1, open(\n",
    "    os.path.join(data_path, \"data.sparql\"), 'r'\n",
    ") as file2:\n",
    "    lines_nl = file1.readlines()\n",
    "    lines_sparql = file2.readlines()\n",
    "    \n",
    "\n",
    "# decode sparql statements to standard format using generator_utils.decode()     \n",
    "lines_sparql = [generator_utils.decode(line) for line in lines_sparql]\n",
    "\n",
    "\n",
    "df_2 = pd.DataFrame({\n",
    "    'nl_question':lines_nl,\n",
    "    'sparql_query':lines_sparql\n",
    "})\n",
    "\n",
    "\n",
    "df_2['nl_question'] = df_2['nl_question'].str.strip()\n",
    "df_2['sparql_query'] = df_2['sparql_query'].str.strip()\n",
    "\n",
    "\n",
    "# drop last row if empty\n",
    "df_2 = df_2.iloc[:-1] if df_2.iloc[-1][0] == '' else df_2   \n",
    "\n",
    "\n",
    "df_2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "4fa8a21f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 3062921:\n",
      "NL=Is 1st nebraska infantry regiment the 2nd commander of azerbaijani special corps ?\n",
      "SPARQL=ask where{dbr:Azerbaijani_Special_Corps dbo:secondCommander dbr:1st_Nebraska_Infantry_Regiment_(1898) }\n",
      "\n",
      "Row 2799740:\n",
      "NL=Is social democratic workers' party in subcarpathian rus' formation year of social democratic workers' party in subcarpathian rus' ?\n",
      "SPARQL=ask where{dbr:Social_Democratic_Workers'_Party_in_Subcarpathian_Rus' dbo:formationYear dbr:Social_Democratic_Workers'_Party_in_Subcarpathian_Rus' }\n",
      "\n",
      "Row 878358:\n",
      "NL=What is the alias of becky g discography's performer ?\n",
      "SPARQL=select ?x where{dbr:Becky_G_discography dbo:artist ?x1 . ?x1 dbo:alias ?x }\n",
      "\n",
      "Row 4605591:\n",
      "NL=Did nepenthes 'kalamity' have cultivar ?\n",
      "SPARQL=ask where{dbr:Nepenthes_'Kalamity' dbo:cultivatedVariety ?x }\n",
      "\n",
      "Row 6943056:\n",
      "NL=Is krt77 Entrezgene good for villin-1 ?\n",
      "SPARQL=ask where{dbr:Villin-1 dbo:entrezgene dbr:KRT77 }\n",
      "\n",
      "Row 361330:\n",
      "NL=Is the casual dress code of hillbilly hot dogs ?\n",
      "SPARQL=ask where{dbr:Hillbilly_Hot_Dogs dbo:dressCode Casual }\n",
      "\n",
      "Row 1764599:\n",
      "NL=What is ChEBI of phenylephrine and thioproperazine ?\n",
      "SPARQL=select ?x where{dbr:Thioproperazine dbo:chEBI ?x . dbr:Phenylephrine dbo:chEBI ?x }\n",
      "\n",
      "Row 2403126:\n",
      "NL=Where is the region of a.s.d. termoli calcio 1920's ground ?\n",
      "SPARQL=select ?x where{dbr:A.S.D._Termoli_Calcio_1920 dbo:ground ?x1 . ?x1 dbo:region ?x }\n",
      "\n",
      "Row 1509306:\n",
      "NL=Is chris seefried a music composer on the pushing tin ?\n",
      "SPARQL=ask where{dbr:Pushing_Tin dbo:musicComposer dbr:Chris_Seefried }\n",
      "\n",
      "Row 1817664:\n",
      "NL=How many population place did ika people have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Ika_people dbo:populationPlace ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# randomly check pairs of NL question and SPARQL queries\n",
    "\n",
    "for index, row in df_2.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "84f0ca9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# save data frames to csv\n",
    "\n",
    "df.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data1249.csv\")\n",
    "df_2.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f56ab14a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "94e0ea99",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08603a47",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "b755121f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td>How many promotions did caravana de campeones ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td>How many promotions did glory by honor xv achi...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td>How many promotions did against all odds achie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td>How many promotions did wrestlemania 21 achieve ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td>How many promotions did hiroshima goddess fest...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               nl_question  \\\n",
       "0         How many floor area did tempe marketplace have ?   \n",
       "1        How many floor area did robert thomson buildin...   \n",
       "2             How many floor area did kingsway mall have ?   \n",
       "3           How many floor area did sm city rosario have ?   \n",
       "4        How many floor area did 1000 second avenue have ?   \n",
       "...                                                    ...   \n",
       "7779525  How many promotions did caravana de campeones ...   \n",
       "7779526  How many promotions did glory by honor xv achi...   \n",
       "7779527  How many promotions did against all odds achie...   \n",
       "7779528  How many promotions did wrestlemania 21 achieve ?   \n",
       "7779529  How many promotions did hiroshima goddess fest...   \n",
       "\n",
       "                                              sparql_query  \n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                    ...  \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...  \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...  \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...  \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...  \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df = pd.read_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data.csv\").drop(columns=['Unnamed: 0'])\n",
    "# df = df.sample(n=100000, random_state=42).reset_index()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "a09e5fad",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 5207679:\n",
      "NL=What is the venerated in of giulia della rena as well as paisios of mount athos ?\n",
      "SPARQL=select ?x where{dbr:Giulia_della_Rena dbo:veneratedIn ?x . dbr:Paisios_of_Mount_Athos dbo:veneratedIn ?x }\n",
      "\n",
      "Row 3797275:\n",
      "NL=What's the head of malcolm bradbury's Alma mater ?\n",
      "SPARQL=select ?x where{dbr:Malcolm_Bradbury dbo:almaMater ?x1 . ?x1 dbo:head ?x }\n",
      "\n",
      "Row 7237639:\n",
      "NL=What is the elevation of the piscataway language's spoken in ?\n",
      "SPARQL=select ?x where{dbr:Piscataway_language dbo:spokenIn ?x1 . ?x1 dbo:elevation ?x }\n",
      "\n",
      "Row 7265658:\n",
      "NL=What time zone does wuxi dialect speak in ?\n",
      "SPARQL=select ?x where{dbr:Wuxi_dialect dbo:spokenIn ?x1 . ?x1 dbo:timeZone ?x }\n",
      "\n",
      "Row 1254457:\n",
      "NL=How many songs by collits' inn did they have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Collits'_Inn_(musical) dbo:musicBy ?x }\n",
      "\n",
      "Row 2408698:\n",
      "NL=What is the synonym of eo la goulette et kram's ground ?\n",
      "SPARQL=select ?x where{dbr:EO_La_Goulette_et_Kram dbo:ground ?x1 . ?x1 dbo:synonym ?x }\n",
      "\n",
      "Row 3890593:\n",
      "NL=Which year took reinhold schmaeling's birth ?\n",
      "SPARQL=select ?x where{dbr:Reinhold_Schmaeling dbo:birthPlace ?x1 . ?x1 dbo:foundingYear ?x }\n",
      "\n",
      "Row 2285893:\n",
      "NL=What is the aircraft fighter of the 165th air support operations squadron Command Structure ?\n",
      "SPARQL=select ?x where{dbr:165th_Air_Support_Operations_Squadron dbo:commandStructure ?x1 . ?x1 dbo:aircraftFighter ?x }\n",
      "\n",
      "Row 3684237:\n",
      "NL=How many philosophicalSchool did ion dragoumis have and how many ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Ion_Dragoumis dbo:philosophicalSchool ?x }\n",
      "\n",
      "Row 3416675:\n",
      "NL=What is the MeSH ID of pituitary apoplexy as well as paraplegia ?\n",
      "SPARQL=select ?x where{dbr:Pituitary_apoplexy dbo:meshId ?x . dbr:Paraplegia dbo:meshId ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for index, row in df.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "7737f987",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['select ?x where{dbr:2003_MLS_All-Star_Game dbo:followingEvent ?x . dbr:Soccer_Bowl:2016 dbo:followingEvent ?x }',\n",
       " 'select ?x where{dbr:West_End_Blues dbo:recordDate ?x . dbr:The_Super_Bowl:Shuffle dbo:recordDate ?x }',\n",
       " 'select ?x where{dbr:Howl:(song) dbo:artist ?x1 . ?x1 dbo:wikiPageID ?x }',\n",
       " 'select ?x where{dbr:Captain_Spaulding_(Rob_Zombie_character) dbo:portrayer ?x . dbr:Artemis_Fowl:II dbo:portrayer ?x }',\n",
       " 'select ?x where{dbr:Sun_Bowl:(stadium) dbo:tenant ?x }',\n",
       " 'select ?x where{dbr:The_Super_Bowl:Shuffle dbo:recordDate ?x . dbr:Cheek_to_Cheek dbo:recordDate ?x }',\n",
       " 'ask where{dbr:Blood_Bowl:(2009_video_game) dbo:publisher ?x }']"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "search_strings = ['owl:']\n",
    "df[df['sparql_query'].apply(lambda x: any(s in x for s in search_strings))]['sparql_query'].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "83054e33",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>prompt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td>How many promotions did caravana de campeones ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td>How many promotions did glory by honor xv achi...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td>How many promotions did against all odds achie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td>How many promotions did wrestlemania 21 achieve ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td>How many promotions did hiroshima goddess fest...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               nl_question  \\\n",
       "0         How many floor area did tempe marketplace have ?   \n",
       "1        How many floor area did robert thomson buildin...   \n",
       "2             How many floor area did kingsway mall have ?   \n",
       "3           How many floor area did sm city rosario have ?   \n",
       "4        How many floor area did 1000 second avenue have ?   \n",
       "...                                                    ...   \n",
       "7779525  How many promotions did caravana de campeones ...   \n",
       "7779526  How many promotions did glory by honor xv achi...   \n",
       "7779527  How many promotions did against all odds achie...   \n",
       "7779528  How many promotions did wrestlemania 21 achieve ?   \n",
       "7779529  How many promotions did hiroshima goddess fest...   \n",
       "\n",
       "                                              sparql_query  \\\n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...   \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...   \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...   \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...   \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...   \n",
       "...                                                    ...   \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...   \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...   \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...   \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...   \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...   \n",
       "\n",
       "                                                    prompt  \n",
       "0        # write a SPARQL query for:\\n# How many floor ...  \n",
       "1        # write a SPARQL query for:\\n# How many floor ...  \n",
       "2        # write a SPARQL query for:\\n# How many floor ...  \n",
       "3        # write a SPARQL query for:\\n# How many floor ...  \n",
       "4        # write a SPARQL query for:\\n# How many floor ...  \n",
       "...                                                    ...  \n",
       "7779525  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779526  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779527  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779528  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779529  # write a SPARQL query for:\\n# How many promot...  \n",
       "\n",
       "[7779530 rows x 3 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def format_prompt(row):\n",
    "    nl_q = row['nl_question']\n",
    "    prompt = f\"# write a SPARQL query for:\\n# {nl_q}\" \n",
    "    return prompt\n",
    "\n",
    "df['prompt'] = df.apply(format_prompt, axis=1)\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "4d8e85c1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# def format_prompt(row):\n",
    "#     nl_q = row['nl_question']\n",
    "#     prompt = \"# write a SPARQL query for:\\n\" + \\\n",
    "#                   f\"# {nl_q}\\n\\n\" + \\\n",
    "#                   \"# use following prefixes:\\n\" + \\\n",
    "#                   \"PREFIX dbr: <http://dbpedia.org/resource/>\\n\" + \\\n",
    "#                   \"PREFIX dbo: <http://dbpedia.org/ontology/>\"\n",
    "#     return prompt\n",
    "\n",
    "# df['prompt'] = df.apply(format_prompt, axis=1)\n",
    "# df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "65e9b4c4",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>prompt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td>How many promotions did caravana de campeones ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td>How many promotions did glory by honor xv achi...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td>How many promotions did against all odds achie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td>How many promotions did wrestlemania 21 achieve ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td>How many promotions did hiroshima goddess fest...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               nl_question  \\\n",
       "0         How many floor area did tempe marketplace have ?   \n",
       "1        How many floor area did robert thomson buildin...   \n",
       "2             How many floor area did kingsway mall have ?   \n",
       "3           How many floor area did sm city rosario have ?   \n",
       "4        How many floor area did 1000 second avenue have ?   \n",
       "...                                                    ...   \n",
       "7779525  How many promotions did caravana de campeones ...   \n",
       "7779526  How many promotions did glory by honor xv achi...   \n",
       "7779527  How many promotions did against all odds achie...   \n",
       "7779528  How many promotions did wrestlemania 21 achieve ?   \n",
       "7779529  How many promotions did hiroshima goddess fest...   \n",
       "\n",
       "                                              sparql_query  \\\n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...   \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...   \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...   \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...   \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...   \n",
       "...                                                    ...   \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...   \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...   \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...   \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...   \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...   \n",
       "\n",
       "                                                    prompt  \n",
       "0        # write a SPARQL query for:\\n# How many floor ...  \n",
       "1        # write a SPARQL query for:\\n# How many floor ...  \n",
       "2        # write a SPARQL query for:\\n# How many floor ...  \n",
       "3        # write a SPARQL query for:\\n# How many floor ...  \n",
       "4        # write a SPARQL query for:\\n# How many floor ...  \n",
       "...                                                    ...  \n",
       "7779525  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779526  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779527  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779528  # write a SPARQL query for:\\n# How many promot...  \n",
       "7779529  # write a SPARQL query for:\\n# How many promot...  \n",
       "\n",
       "[7779530 rows x 3 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ca3e5d43",
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'sparql_query'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "File \u001b[0;32m~/anaconda3/envs/dbpedia/lib/python3.10/site-packages/pandas/core/indexes/base.py:3653\u001b[0m, in \u001b[0;36mIndex.get_loc\u001b[0;34m(self, key)\u001b[0m\n\u001b[1;32m   3652\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m-> 3653\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_engine\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_loc\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcasted_key\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   3654\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mKeyError\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m err:\n",
      "File \u001b[0;32m~/anaconda3/envs/dbpedia/lib/python3.10/site-packages/pandas/_libs/index.pyx:147\u001b[0m, in \u001b[0;36mpandas._libs.index.IndexEngine.get_loc\u001b[0;34m()\u001b[0m\n",
      "File \u001b[0;32m~/anaconda3/envs/dbpedia/lib/python3.10/site-packages/pandas/_libs/index.pyx:176\u001b[0m, in \u001b[0;36mpandas._libs.index.IndexEngine.get_loc\u001b[0;34m()\u001b[0m\n",
      "File \u001b[0;32mpandas/_libs/hashtable_class_helper.pxi:7080\u001b[0m, in \u001b[0;36mpandas._libs.hashtable.PyObjectHashTable.get_item\u001b[0;34m()\u001b[0m\n",
      "File \u001b[0;32mpandas/_libs/hashtable_class_helper.pxi:7088\u001b[0m, in \u001b[0;36mpandas._libs.hashtable.PyObjectHashTable.get_item\u001b[0;34m()\u001b[0m\n",
      "\u001b[0;31mKeyError\u001b[0m: 'sparql_query'",
      "\nThe above exception was the direct cause of the following exception:\n",
      "\u001b[0;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[11], line 3\u001b[0m\n\u001b[1;32m      1\u001b[0m df \u001b[38;5;241m=\u001b[39m pd\u001b[38;5;241m.\u001b[39mDataFrame({\n\u001b[1;32m      2\u001b[0m     \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mprompt\u001b[39m\u001b[38;5;124m'\u001b[39m: df[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mprompt\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;241m.\u001b[39mto_list(),\n\u001b[0;32m----> 3\u001b[0m     \u001b[38;5;124m'\u001b[39m\u001b[38;5;124mcompletion\u001b[39m\u001b[38;5;124m'\u001b[39m: \u001b[43mdf\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43msparql_query\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m]\u001b[49m\u001b[38;5;241m.\u001b[39mto_list()\n\u001b[1;32m      4\u001b[0m })\n\u001b[1;32m      6\u001b[0m df\u001b[38;5;241m.\u001b[39mto_csv(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m/home/mehrzad/repos/mehrz/dbpedia/data/nspm_fine_tuning_data.csv\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m      7\u001b[0m df\n",
      "File \u001b[0;32m~/anaconda3/envs/dbpedia/lib/python3.10/site-packages/pandas/core/frame.py:3761\u001b[0m, in \u001b[0;36mDataFrame.__getitem__\u001b[0;34m(self, key)\u001b[0m\n\u001b[1;32m   3759\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mcolumns\u001b[38;5;241m.\u001b[39mnlevels \u001b[38;5;241m>\u001b[39m \u001b[38;5;241m1\u001b[39m:\n\u001b[1;32m   3760\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_getitem_multilevel(key)\n\u001b[0;32m-> 3761\u001b[0m indexer \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mcolumns\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget_loc\u001b[49m\u001b[43m(\u001b[49m\u001b[43mkey\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   3762\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m is_integer(indexer):\n\u001b[1;32m   3763\u001b[0m     indexer \u001b[38;5;241m=\u001b[39m [indexer]\n",
      "File \u001b[0;32m~/anaconda3/envs/dbpedia/lib/python3.10/site-packages/pandas/core/indexes/base.py:3655\u001b[0m, in \u001b[0;36mIndex.get_loc\u001b[0;34m(self, key)\u001b[0m\n\u001b[1;32m   3653\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_engine\u001b[38;5;241m.\u001b[39mget_loc(casted_key)\n\u001b[1;32m   3654\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mKeyError\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m err:\n\u001b[0;32m-> 3655\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mKeyError\u001b[39;00m(key) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;21;01merr\u001b[39;00m\n\u001b[1;32m   3656\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mTypeError\u001b[39;00m:\n\u001b[1;32m   3657\u001b[0m     \u001b[38;5;66;03m# If we have a listlike key, _check_indexing_error will raise\u001b[39;00m\n\u001b[1;32m   3658\u001b[0m     \u001b[38;5;66;03m#  InvalidIndexError. Otherwise we fall through and re-raise\u001b[39;00m\n\u001b[1;32m   3659\u001b[0m     \u001b[38;5;66;03m#  the TypeError.\u001b[39;00m\n\u001b[1;32m   3660\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_check_indexing_error(key)\n",
      "\u001b[0;31mKeyError\u001b[0m: 'sparql_query'"
     ]
    }
   ],
   "source": [
    "df = pd.DataFrame({\n",
    "    'prompt': df['prompt'].to_list(),\n",
    "    'completion': df['sparql_query'].to_list()\n",
    "})\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "09e1fe70",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>prompt</th>\n",
       "      <th>completion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    prompt  \\\n",
       "0        # write a SPARQL query for:\\n# How many floor ...   \n",
       "1        # write a SPARQL query for:\\n# How many floor ...   \n",
       "2        # write a SPARQL query for:\\n# How many floor ...   \n",
       "3        # write a SPARQL query for:\\n# How many floor ...   \n",
       "4        # write a SPARQL query for:\\n# How many floor ...   \n",
       "...                                                    ...   \n",
       "7779525  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779526  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779527  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779528  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779529  # write a SPARQL query for:\\n# How many promot...   \n",
       "\n",
       "                                                completion  \n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                    ...  \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...  \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...  \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...  \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...  \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "fd55ca99",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# write a SPARQL query for:\n",
      "# Did honda indy v8 engine have block alloy in it's design ? \n",
      "\n",
      "ask where{dbr:Honda_Indy_V8_engine dbo:blockAlloy ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is hai ISO 639haida language3 code of haida language or IAS 659haida language7 code of hai ? \n",
      "\n",
      "ask where{dbr:Haida_language dbo:iso6393Code hai } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is bentley state limousine body style of <B> or <B> ? \n",
      "\n",
      "ask where{<B> dbo:bodyStyle dbr:Bentley_State_Limousine } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is ogden mills phipps breeder of sovereign dancer or for which brand ? \n",
      "\n",
      "ask where{dbr:Sovereign_Dancer dbo:breeder dbr:Ogden_Mills_Phipps } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is training of sophonisba angusciola peale ? \n",
      "\n",
      "select ?x where{dbr:Sophonisba_Angusciola_Peale dbo:training ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Did premakke sai get a producer or a publisher ? \n",
      "\n",
      "ask where{dbr:Premakke_Sai dbo:producer ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Did 182 elsa have discovery date ? \n",
      "\n",
      "ask where{dbr:182_Elsa dbo:discovered ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the abstract of geography of a horse dreamer's language ? \n",
      "\n",
      "select ?x where{dbr:Geography_of_a_Horse_Dreamer dbo:originalLanguage ?x1 . ?x1 dbo:abstract ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the maintained by of antioch bridge as well as batang mukah bridge ? \n",
      "\n",
      "select ?x where{dbr:Antioch_Bridge dbo:maintainedBy ?x . dbr:Batang_Mukah_Bridge dbo:maintainedBy ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the offered classes of center high school as well as charleston high school ? \n",
      "\n",
      "select ?x where{dbr:Center_High_School_(California) dbo:offeredClasses ?x . dbr:Charleston_High_School_(Arkansas) dbo:offeredClasses ?x } \n",
      "==================================================\n"
     ]
    }
   ],
   "source": [
    "for i, row in df.sample(n=10).iterrows():\n",
    "    print(row['prompt'], '\\n')\n",
    "    print(row['completion'], '\\n'+'='*50)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1cf6abe3",
   "metadata": {},
   "source": [
    "## Save data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "fe149fd6",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/nspm_fine_tuning_data.csv\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "ca375eba",
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.utils import shuffle\n",
    "from sklearn.model_selection import train_test_split\n",
    "\n",
    "\n",
    "random_seed = 42\n",
    "\n",
    "# df = pd.read_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/nspm_fine_tuning_data.csv\")\n",
    "\n",
    "# df = shuffle(df, random_state=random_seed)\n",
    "\n",
    "# n_train = 100000\n",
    "# n_val = 20000\n",
    "# n_test = 20000\n",
    "\n",
    "# df_train = df.iloc[:n_train]\n",
    "# df_val = df.iloc[n_train:n_train+n_val]\n",
    "# df_test = df.iloc[n_train+n_val:n_train+n_val+n_test]\n",
    "\n",
    "\n",
    "df_train.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/nspm-fine-tuning/train.csv\", index=True)\n",
    "df_val.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/nspm-fine-tuning/val.csv\", index=True)\n",
    "df_test.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/nspm-fine-tuning/test.csv\", index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "07691d65",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>prompt</th>\n",
       "      <th>completion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3938592</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the Lin...</td>\n",
       "      <td>select ?x where{dbr:Karl_Marx dbo:birthPlace ?...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4874853</th>\n",
       "      <td># write a SPARQL query for:\\n# Is diocesan col...</td>\n",
       "      <td>ask where{dbr:Morgan_Newman dbo:school dbr:Dio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3873129</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the cou...</td>\n",
       "      <td>select ?x where{dbr:Canário dbo:birthPlace ?x1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2096744</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the por...</td>\n",
       "      <td>select ?x where{dbr:Stella_Bonasera dbo:portra...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5444409</th>\n",
       "      <td># write a SPARQL query for:\\n# Has south afric...</td>\n",
       "      <td>ask where{dbr:South_African_Class_16E dbo:rebu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5946095</th>\n",
       "      <td># write a SPARQL query for:\\n# How many diamet...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Volterra_(crat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>593656</th>\n",
       "      <td># write a SPARQL query for:\\n# How is hyatt re...</td>\n",
       "      <td>select ?x where{dbr:Hyatt_Regency_Chicago dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5078042</th>\n",
       "      <td># write a SPARQL query for:\\n# Who is thomas d...</td>\n",
       "      <td>select ?x where{dbr:Thomas_Dudley dbo:father ?...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57215</th>\n",
       "      <td># write a SPARQL query for:\\n# What are most o...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Schuylkill_Ars...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7695828</th>\n",
       "      <td># write a SPARQL query for:\\n# How many next e...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Alpine_skiing_...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>20000 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    prompt  \\\n",
       "3938592  # write a SPARQL query for:\\n# What is the Lin...   \n",
       "4874853  # write a SPARQL query for:\\n# Is diocesan col...   \n",
       "3873129  # write a SPARQL query for:\\n# What is the cou...   \n",
       "2096744  # write a SPARQL query for:\\n# What is the por...   \n",
       "5444409  # write a SPARQL query for:\\n# Has south afric...   \n",
       "...                                                    ...   \n",
       "5946095  # write a SPARQL query for:\\n# How many diamet...   \n",
       "593656   # write a SPARQL query for:\\n# How is hyatt re...   \n",
       "5078042  # write a SPARQL query for:\\n# Who is thomas d...   \n",
       "57215    # write a SPARQL query for:\\n# What are most o...   \n",
       "7695828  # write a SPARQL query for:\\n# How many next e...   \n",
       "\n",
       "                                                completion  \n",
       "3938592  select ?x where{dbr:Karl_Marx dbo:birthPlace ?...  \n",
       "4874853  ask where{dbr:Morgan_Newman dbo:school dbr:Dio...  \n",
       "3873129  select ?x where{dbr:Canário dbo:birthPlace ?x1...  \n",
       "2096744  select ?x where{dbr:Stella_Bonasera dbo:portra...  \n",
       "5444409  ask where{dbr:South_African_Class_16E dbo:rebu...  \n",
       "...                                                    ...  \n",
       "5946095  select count(*) as ?x where{dbr:Volterra_(crat...  \n",
       "593656   select ?x where{dbr:Hyatt_Regency_Chicago dbo:...  \n",
       "5078042  select ?x where{dbr:Thomas_Dudley dbo:father ?...  \n",
       "57215    select count(*) as ?x where{dbr:Schuylkill_Ars...  \n",
       "7695828  select count(*) as ?x where{dbr:Alpine_skiing_...  \n",
       "\n",
       "[20000 rows x 2 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_test"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "2a0cb10c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>prompt</th>\n",
       "      <th>completion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td># write a SPARQL query for:\\n# How many floor ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td># write a SPARQL query for:\\n# How many promot...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    prompt  \\\n",
       "0        # write a SPARQL query for:\\n# How many floor ...   \n",
       "1        # write a SPARQL query for:\\n# How many floor ...   \n",
       "2        # write a SPARQL query for:\\n# How many floor ...   \n",
       "3        # write a SPARQL query for:\\n# How many floor ...   \n",
       "4        # write a SPARQL query for:\\n# How many floor ...   \n",
       "...                                                    ...   \n",
       "7779525  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779526  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779527  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779528  # write a SPARQL query for:\\n# How many promot...   \n",
       "7779529  # write a SPARQL query for:\\n# How many promot...   \n",
       "\n",
       "                                                completion  \n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                    ...  \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...  \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...  \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...  \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...  \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "f4e232b8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>prompt</th>\n",
       "      <th>completion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3382376</th>\n",
       "      <td># write a SPARQL query for:\\n# How many ICD9 d...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Friedreich's_a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2559914</th>\n",
       "      <td># write a SPARQL query for:\\n# What was the fa...</td>\n",
       "      <td>select ?x where{dbr:Destrehan_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2990831</th>\n",
       "      <td># write a SPARQL query for:\\n# Does adventist ...</td>\n",
       "      <td>ask where{dbr:Adventist_Girls_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1637967</th>\n",
       "      <td># write a SPARQL query for:\\n# Did aliens area...</td>\n",
       "      <td>ask where{dbr:Aliens_Area dbo:lastPublicationD...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1507546</th>\n",
       "      <td># write a SPARQL query for:\\n# Did bridget jon...</td>\n",
       "      <td>ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6550634</th>\n",
       "      <td># write a SPARQL query for:\\n# Is pöyrysjärvi ...</td>\n",
       "      <td>ask where{&lt;B&gt; dbo:outflow dbr:Pöyrysjärvi_(Myr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7705870</th>\n",
       "      <td># write a SPARQL query for:\\n# How many missio...</td>\n",
       "      <td>select count(*) as ?x where{dbr:SNC_Demo-1 dbo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6423388</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the cou...</td>\n",
       "      <td>select ?x where{dbr:Piscataquis_County,_Maine ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6962611</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the arm...</td>\n",
       "      <td>select ?x where{dbr:Electron-transferring-flav...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6413414</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the cap...</td>\n",
       "      <td>select ?x where{dbr:Sierra_Leone_Colony_and_Pr...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                    prompt  \\\n",
       "3382376  # write a SPARQL query for:\\n# How many ICD9 d...   \n",
       "2559914  # write a SPARQL query for:\\n# What was the fa...   \n",
       "2990831  # write a SPARQL query for:\\n# Does adventist ...   \n",
       "1637967  # write a SPARQL query for:\\n# Did aliens area...   \n",
       "1507546  # write a SPARQL query for:\\n# Did bridget jon...   \n",
       "...                                                    ...   \n",
       "6550634  # write a SPARQL query for:\\n# Is pöyrysjärvi ...   \n",
       "7705870  # write a SPARQL query for:\\n# How many missio...   \n",
       "6423388  # write a SPARQL query for:\\n# What is the cou...   \n",
       "6962611  # write a SPARQL query for:\\n# What is the arm...   \n",
       "6413414  # write a SPARQL query for:\\n# What is the cap...   \n",
       "\n",
       "                                                completion  \n",
       "3382376  select count(*) as ?x where{dbr:Friedreich's_a...  \n",
       "2559914  select ?x where{dbr:Destrehan_High_School dbo:...  \n",
       "2990831  ask where{dbr:Adventist_Girls_High_School dbo:...  \n",
       "1637967  ask where{dbr:Aliens_Area dbo:lastPublicationD...  \n",
       "1507546  ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...  \n",
       "...                                                    ...  \n",
       "6550634  ask where{<B> dbo:outflow dbr:Pöyrysjärvi_(Myr...  \n",
       "7705870  select count(*) as ?x where{dbr:SNC_Demo-1 dbo...  \n",
       "6423388  select ?x where{dbr:Piscataquis_County,_Maine ...  \n",
       "6962611  select ?x where{dbr:Electron-transferring-flav...  \n",
       "6413414  select ?x where{dbr:Sierra_Leone_Colony_and_Pr...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8957ff4",
   "metadata": {},
   "source": [
    "#\n",
    "## QALD9-plus"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "8df2f456",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'id': '1',\n",
       " 'question': [{'language': 'en', 'string': 'List all boardgames by GMT.'},\n",
       "  {'language': 'de', 'string': 'Liste die Brettspiele von GMT auf.'},\n",
       "  {'language': 'de', 'string': 'Zeige mir alle Brettspiele von GMT.'},\n",
       "  {'language': 'ru', 'string': 'Перечислите все игры GMT.'},\n",
       "  {'language': 'lt', 'string': 'Išvardinkite visus stalo žaidimus pagal GMT.'},\n",
       "  {'language': 'uk', 'string': 'Перерахуйте всі ігри GMT.'},\n",
       "  {'language': 'lt', 'string': 'Išvardykite visus GMT žaidimus.'},\n",
       "  {'language': 'fr', 'string': 'Listez tous les jeux de société de GMT.'},\n",
       "  {'language': 'es',\n",
       "   'string': '¿Qué juegos de mesa fueron hechos por GMT?',\n",
       "   'keywords': 'juego de mesa ,  GMT '}],\n",
       " 'query': {'sparql': 'PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }'},\n",
       " 'answers': [{'head': {'link': [], 'vars': ['uri']},\n",
       "   'results': {'bindings': [{'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Chandragupta_(board_game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Fields_of_Fire_(game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Sword_of_Rome'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Paths_of_Glory_(board_game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Commands_&_Colors:_Ancients'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Labyrinth:_The_War_on_Terror,_2001_–_%3F'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Twilight_Struggle'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': \"http://dbpedia.org/resource/Washington's_War\"}}]}}]}"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "with open('data/qald_9_plus_train_dbpedia.json', 'r') as f:\n",
    "    qald_9_plus_data = json.load(f)\n",
    "    \n",
    "qald_9_plus_data['questions'][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2e3e04c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "List all boardgames by GMT.\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      " SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }\n"
     ]
    }
   ],
   "source": [
    "# extracting pairs of question/sparql    \n",
    "    \n",
    "english_questions, sparql_queries =[],[]\n",
    "for data in qald_9_plus_data['questions']:\n",
    "    english_questions.append(\n",
    "        next((item['string'] for item in data['question'] if item['language'] == 'en'), None)\n",
    "    )\n",
    "    sparql_queries.append(data['query']['sparql'])\n",
    "    \n",
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[0])\n",
    "print('\\n', sparql_queries[0].replace(\">\", '>\\n'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "83b09086",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "Give me all Danish films.\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      " SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[10])\n",
    "print('\\n', sparql_queries[10].replace(\">\", '>\\n'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "691c6c65",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "Who wrote the book The pillars of the Earth?\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      " SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[20])\n",
    "print('\\n', sparql_queries[20].replace(\">\", '>\\n'))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "dbpedia-env",
   "language": "python",
   "name": "dbpedia"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
