{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3c6cbceb",
   "metadata": {},
   "source": [
    "#\n",
    "## NsPM data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "03c2d26e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['data1249.sparql',\n",
       " 'final_paraphrased_templates',\n",
       " 'data.sparql',\n",
       " 'data1249.en',\n",
       " 'data.en',\n",
       " 'drive-download-20230727T150544Z-001.zip']"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "\n",
    "data_path = \"/home/mehrzad/repos/mehrz/dbpedia/data/data-saurav/\"\n",
    "\n",
    "os.listdir(data_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "bcd14976",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "How many floor area did tempe marketplace have ?\n",
      "How many floor area did robert thomson building have ?\n",
      "How many floor area did kingsway mall have ?\n",
      "How many floor area did sm city rosario have ?\n",
      "How many floor area did 1000 second avenue have ?\n",
      "How many floor area did spectrum have ?\n",
      "How many floor area did headquarters of the federal intelligence service have ?\n",
      "How many floor area did house of awakened culture have ?\n",
      "How many floor area did tiaa bank center have ?\n",
      "How many floor area did liberty center have ?\n"
     ]
    }
   ],
   "source": [
    "with open(os.path.join(data_path, \"data1249.en\"), 'r') as file:\n",
    "    for i,line in enumerate(file):\n",
    "        print(line.strip()) if i<10 else None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "397bf0b9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Tempe_Marketplace dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Robert_Thomson_Building dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Kingsway_Mall dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_SM_City_Rosario dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_1000_Second_Avenue dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Spectrum,_Bristol dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Headquarters_of_the_Federal_Intelligence_Service dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_House_of_Awakened_Culture dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_TIAA_Bank_Center dbo_floorArea var_x brack_close\n",
      "select count attr_open wildcard attr_close as var_x where brack_open dbr_Liberty_Center_(mall) dbo_floorArea var_x brack_close\n"
     ]
    }
   ],
   "source": [
    "with open(os.path.join(data_path, \"data1249.sparql\"), 'r') as file:\n",
    "    for i,line in enumerate(file):\n",
    "        print(line.strip()) if i<10 else None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "3ca25158",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314893</th>\n",
       "      <td>Is frank e. bauer bridge length of minnesota s...</td>\n",
       "      <td>ask where{dbr:Minnesota_State_Highway_267 dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314894</th>\n",
       "      <td>Is prudential tunnel length of ben sawyer brid...</td>\n",
       "      <td>ask where{dbr:Ben_Sawyer_Bridge dbo:length dbr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314895</th>\n",
       "      <td>Is river suir bridge length of mckinley bridge ?</td>\n",
       "      <td>ask where{dbr:McKinley_Bridge dbo:length dbr:R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314896</th>\n",
       "      <td>Is mckinley washington jr. bridge length of ch...</td>\n",
       "      <td>ask where{dbr:Chūō_Expressway dbo:length dbr:M...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314897</th>\n",
       "      <td>Is saltstraumen bridge length of saskatchewan ...</td>\n",
       "      <td>ask where{dbr:Saskatchewan_Highway_904 dbo:len...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>314898 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              nl_question  \\\n",
       "0        How many floor area did tempe marketplace have ?   \n",
       "1       How many floor area did robert thomson buildin...   \n",
       "2            How many floor area did kingsway mall have ?   \n",
       "3          How many floor area did sm city rosario have ?   \n",
       "4       How many floor area did 1000 second avenue have ?   \n",
       "...                                                   ...   \n",
       "314893  Is frank e. bauer bridge length of minnesota s...   \n",
       "314894  Is prudential tunnel length of ben sawyer brid...   \n",
       "314895   Is river suir bridge length of mckinley bridge ?   \n",
       "314896  Is mckinley washington jr. bridge length of ch...   \n",
       "314897  Is saltstraumen bridge length of saskatchewan ...   \n",
       "\n",
       "                                             sparql_query  \n",
       "0       select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1       select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2       select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3       select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4       select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                   ...  \n",
       "314893  ask where{dbr:Minnesota_State_Highway_267 dbo:...  \n",
       "314894  ask where{dbr:Ben_Sawyer_Bridge dbo:length dbr...  \n",
       "314895  ask where{dbr:McKinley_Bridge dbo:length dbr:R...  \n",
       "314896  ask where{dbr:Chūō_Expressway dbo:length dbr:M...  \n",
       "314897  ask where{dbr:Saskatchewan_Highway_904 dbo:len...  \n",
       "\n",
       "[314898 rows x 2 columns]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# import sys\n",
    "# sys.path.append('/home/mehrzad/repos/mehrz/dbpedia/neural-qa-mehrzadshm')\n",
    "# from nspm import generator_utils\n",
    "# import pandas as pd\n",
    "\n",
    "\n",
    "# with open(\n",
    "#     os.path.join(data_path, \"data1249.en\"), 'r'\n",
    "# ) as file1, open(\n",
    "#     os.path.join(data_path, \"data1249.sparql\"), 'r'\n",
    "# ) as file2:\n",
    "#     lines_nl = file1.readlines()\n",
    "#     lines_sparql = file2.readlines()\n",
    "    \n",
    "\n",
    "    \n",
    "# # decode sparql statements to standard format using generator_utils.decode()     \n",
    "# lines_sparql = [generator_utils.decode(line) for line in lines_sparql]\n",
    "\n",
    "\n",
    "# df = pd.DataFrame({\n",
    "#     'nl_question':lines_nl,\n",
    "#     'sparql_query':lines_sparql\n",
    "# })\n",
    "\n",
    "\n",
    "# df['nl_question'] = df['nl_question'].str.strip()\n",
    "# df['sparql_query'] = df['sparql_query'].str.strip()\n",
    "\n",
    "# df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "fe4a2da7",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 235481:\n",
      "NL=What is the rebuilding year of tai wai station ?\n",
      "SPARQL=select ?x where{dbr:Tai_Wai_station dbo:rebuildingYear ?x }\n",
      "\n",
      "Row 154910:\n",
      "NL=What was the significant project of loudoun house's architect ?\n",
      "SPARQL=select ?x where{dbr:Loudoun_House dbo:architect ?x1 . ?x1 dbo:significantProject ?x }\n",
      "\n",
      "Row 93671:\n",
      "NL=Which route did aqua line have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Aqua_Line_(Pune_Metro) dbo:routeStart ?x }\n",
      "\n",
      "Row 62059:\n",
      "NL=What are the suites in the westin grand ?\n",
      "SPARQL=select count(*) as ?x where{dbr:The_Westin_Grand,_Vancouver dbo:numberOfSuites ?x }\n",
      "\n",
      "Row 38691:\n",
      "NL=What is the installed capacity of greifswald power station ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Greifswald_Power_Station dbo:installedCapacity ?x }\n",
      "\n",
      "Row 185766:\n",
      "NL=What is valhalla station fare zone ?\n",
      "SPARQL=select ?x where{dbr:Valhalla_station dbo:fareZone ?x }\n",
      "\n",
      "Row 131905:\n",
      "NL=How long is corby bridge ?\n",
      "SPARQL=select ?x where{dbr:Corby_Bridge dbo:length ?x }\n",
      "\n",
      "Row 138234:\n",
      "NL=What is the birth name of the percival molson memorial stadium's architect ?\n",
      "SPARQL=select ?x where{dbr:Percival_Molson_Memorial_Stadium dbo:architect ?x1 . ?x1 dbo:birthName ?x }\n",
      "\n",
      "Row 245281:\n",
      "NL=What is the parking information of joondalup line's route end ?\n",
      "SPARQL=select ?x where{dbr:Joondalup_line dbo:routeEnd ?x1 . ?x1 dbo:parkingInformation ?x }\n",
      "\n",
      "Row 34015:\n",
      "NL=How many chef did saint pierre have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Saint_Pierre_(restaurant) dbo:headChef ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# randomly check pairs of NL question and SPARQL queries\n",
    "\n",
    "for index, row in df.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "4bf6d612",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>How many floor area did tempe marketplace have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Tempe_Marketpl...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>How many floor area did robert thomson buildin...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Robert_Thomson...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>How many floor area did kingsway mall have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Kingsway_Mall ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>How many floor area did sm city rosario have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:SM_City_Rosari...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>How many floor area did 1000 second avenue have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:1000_Second_Av...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779525</th>\n",
       "      <td>How many promotions did caravana de campeones ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Caravana_de_Ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779526</th>\n",
       "      <td>How many promotions did glory by honor xv achi...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Glory_By_Honor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779527</th>\n",
       "      <td>How many promotions did against all odds achie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Against_All_Od...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779528</th>\n",
       "      <td>How many promotions did wrestlemania 21 achieve ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:WrestleMania_2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7779529</th>\n",
       "      <td>How many promotions did hiroshima goddess fest...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Hiroshima_Godd...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>7779530 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               nl_question  \\\n",
       "0         How many floor area did tempe marketplace have ?   \n",
       "1        How many floor area did robert thomson buildin...   \n",
       "2             How many floor area did kingsway mall have ?   \n",
       "3           How many floor area did sm city rosario have ?   \n",
       "4        How many floor area did 1000 second avenue have ?   \n",
       "...                                                    ...   \n",
       "7779525  How many promotions did caravana de campeones ...   \n",
       "7779526  How many promotions did glory by honor xv achi...   \n",
       "7779527  How many promotions did against all odds achie...   \n",
       "7779528  How many promotions did wrestlemania 21 achieve ?   \n",
       "7779529  How many promotions did hiroshima goddess fest...   \n",
       "\n",
       "                                              sparql_query  \n",
       "0        select count(*) as ?x where{dbr:Tempe_Marketpl...  \n",
       "1        select count(*) as ?x where{dbr:Robert_Thomson...  \n",
       "2        select count(*) as ?x where{dbr:Kingsway_Mall ...  \n",
       "3        select count(*) as ?x where{dbr:SM_City_Rosari...  \n",
       "4        select count(*) as ?x where{dbr:1000_Second_Av...  \n",
       "...                                                    ...  \n",
       "7779525  select count(*) as ?x where{dbr:Caravana_de_Ca...  \n",
       "7779526  select count(*) as ?x where{dbr:Glory_By_Honor...  \n",
       "7779527  select count(*) as ?x where{dbr:Against_All_Od...  \n",
       "7779528  select count(*) as ?x where{dbr:WrestleMania_2...  \n",
       "7779529  select count(*) as ?x where{dbr:Hiroshima_Godd...  \n",
       "\n",
       "[7779530 rows x 2 columns]"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with open(\n",
    "    os.path.join(data_path, \"data.en\"), 'r'\n",
    ") as file1, open(\n",
    "    os.path.join(data_path, \"data.sparql\"), 'r'\n",
    ") as file2:\n",
    "    lines_nl = file1.readlines()\n",
    "    lines_sparql = file2.readlines()\n",
    "    \n",
    "\n",
    "# decode sparql statements to standard format using generator_utils.decode()     \n",
    "lines_sparql = [generator_utils.decode(line) for line in lines_sparql]\n",
    "\n",
    "\n",
    "df_2 = pd.DataFrame({\n",
    "    'nl_question':lines_nl,\n",
    "    'sparql_query':lines_sparql\n",
    "})\n",
    "\n",
    "\n",
    "df_2['nl_question'] = df_2['nl_question'].str.strip()\n",
    "df_2['sparql_query'] = df_2['sparql_query'].str.strip()\n",
    "\n",
    "\n",
    "# drop last row if empty\n",
    "df_2 = df_2.iloc[:-1] if df_2.iloc[-1][0] == '' else df_2   \n",
    "\n",
    "\n",
    "df_2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "4fa8a21f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 3062921:\n",
      "NL=Is 1st nebraska infantry regiment the 2nd commander of azerbaijani special corps ?\n",
      "SPARQL=ask where{dbr:Azerbaijani_Special_Corps dbo:secondCommander dbr:1st_Nebraska_Infantry_Regiment_(1898) }\n",
      "\n",
      "Row 2799740:\n",
      "NL=Is social democratic workers' party in subcarpathian rus' formation year of social democratic workers' party in subcarpathian rus' ?\n",
      "SPARQL=ask where{dbr:Social_Democratic_Workers'_Party_in_Subcarpathian_Rus' dbo:formationYear dbr:Social_Democratic_Workers'_Party_in_Subcarpathian_Rus' }\n",
      "\n",
      "Row 878358:\n",
      "NL=What is the alias of becky g discography's performer ?\n",
      "SPARQL=select ?x where{dbr:Becky_G_discography dbo:artist ?x1 . ?x1 dbo:alias ?x }\n",
      "\n",
      "Row 4605591:\n",
      "NL=Did nepenthes 'kalamity' have cultivar ?\n",
      "SPARQL=ask where{dbr:Nepenthes_'Kalamity' dbo:cultivatedVariety ?x }\n",
      "\n",
      "Row 6943056:\n",
      "NL=Is krt77 Entrezgene good for villin-1 ?\n",
      "SPARQL=ask where{dbr:Villin-1 dbo:entrezgene dbr:KRT77 }\n",
      "\n",
      "Row 361330:\n",
      "NL=Is the casual dress code of hillbilly hot dogs ?\n",
      "SPARQL=ask where{dbr:Hillbilly_Hot_Dogs dbo:dressCode Casual }\n",
      "\n",
      "Row 1764599:\n",
      "NL=What is ChEBI of phenylephrine and thioproperazine ?\n",
      "SPARQL=select ?x where{dbr:Thioproperazine dbo:chEBI ?x . dbr:Phenylephrine dbo:chEBI ?x }\n",
      "\n",
      "Row 2403126:\n",
      "NL=Where is the region of a.s.d. termoli calcio 1920's ground ?\n",
      "SPARQL=select ?x where{dbr:A.S.D._Termoli_Calcio_1920 dbo:ground ?x1 . ?x1 dbo:region ?x }\n",
      "\n",
      "Row 1509306:\n",
      "NL=Is chris seefried a music composer on the pushing tin ?\n",
      "SPARQL=ask where{dbr:Pushing_Tin dbo:musicComposer dbr:Chris_Seefried }\n",
      "\n",
      "Row 1817664:\n",
      "NL=How many population place did ika people have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Ika_people dbo:populationPlace ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# randomly check pairs of NL question and SPARQL queries\n",
    "\n",
    "for index, row in df_2.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "84f0ca9a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# save data frames to csv\n",
    "\n",
    "df.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data1249.csv\")\n",
    "df_2.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f56ab14a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "94e0ea99",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08603a47",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "b755121f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3382376</td>\n",
       "      <td>How many ICD9 did friedreich's ataxia have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Friedreich's_a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2559914</td>\n",
       "      <td>What was the faculty size of destrehan high sc...</td>\n",
       "      <td>select ?x where{dbr:Destrehan_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2990831</td>\n",
       "      <td>Does adventist girls high school have any over...</td>\n",
       "      <td>ask where{dbr:Adventist_Girls_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1637967</td>\n",
       "      <td>Did aliens area have one last publication date ?</td>\n",
       "      <td>ask where{dbr:Aliens_Area dbo:lastPublicationD...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1507546</td>\n",
       "      <td>Did bridget jones: the edge of reason have a m...</td>\n",
       "      <td>ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99995</th>\n",
       "      <td>7260453</td>\n",
       "      <td>What is the population density of southern yuk...</td>\n",
       "      <td>select ?x where{dbr:Southern_Yukaghir_language...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99996</th>\n",
       "      <td>6784536</td>\n",
       "      <td>Is washington county city a type of mitchell c...</td>\n",
       "      <td>ask where{dbr:Mitchell_County,_North_Carolina ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99997</th>\n",
       "      <td>3733762</td>\n",
       "      <td>How many married couples did bernardine dohrn ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Bernardine_Doh...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99998</th>\n",
       "      <td>7637742</td>\n",
       "      <td>What are the battle of magdala and battle of ș...</td>\n",
       "      <td>select ?x where{dbr:Battle_of_Magdala dbo:resu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99999</th>\n",
       "      <td>5249851</td>\n",
       "      <td>Did the falu red have a red coordinate in the ...</td>\n",
       "      <td>ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100000 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         index                                        nl_question  \\\n",
       "0      3382376       How many ICD9 did friedreich's ataxia have ?   \n",
       "1      2559914  What was the faculty size of destrehan high sc...   \n",
       "2      2990831  Does adventist girls high school have any over...   \n",
       "3      1637967   Did aliens area have one last publication date ?   \n",
       "4      1507546  Did bridget jones: the edge of reason have a m...   \n",
       "...        ...                                                ...   \n",
       "99995  7260453  What is the population density of southern yuk...   \n",
       "99996  6784536  Is washington county city a type of mitchell c...   \n",
       "99997  3733762  How many married couples did bernardine dohrn ...   \n",
       "99998  7637742  What are the battle of magdala and battle of ș...   \n",
       "99999  5249851  Did the falu red have a red coordinate in the ...   \n",
       "\n",
       "                                            sparql_query  \n",
       "0      select count(*) as ?x where{dbr:Friedreich's_a...  \n",
       "1      select ?x where{dbr:Destrehan_High_School dbo:...  \n",
       "2      ask where{dbr:Adventist_Girls_High_School dbo:...  \n",
       "3      ask where{dbr:Aliens_Area dbo:lastPublicationD...  \n",
       "4      ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...  \n",
       "...                                                  ...  \n",
       "99995  select ?x where{dbr:Southern_Yukaghir_language...  \n",
       "99996  ask where{dbr:Mitchell_County,_North_Carolina ...  \n",
       "99997  select count(*) as ?x where{dbr:Bernardine_Doh...  \n",
       "99998  select ?x where{dbr:Battle_of_Magdala dbo:resu...  \n",
       "99999  ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...  \n",
       "\n",
       "[100000 rows x 3 columns]"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "df = pd.read_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/data.csv\").drop(columns=['Unnamed: 0'])\n",
    "df = df.sample(n=100000, random_state=42).reset_index()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "a09e5fad",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Row 69815:\n",
      "NL=Did society of devotees of the islamic revolution have national affiliation ?\n",
      "SPARQL=ask where{dbr:Society_of_Devotees_of_the_Islamic_Revolution dbo:nationalAffiliation ?x }\n",
      "\n",
      "Row 77464:\n",
      "NL=Is moon over las vegas starring in campbell's kingdom ?\n",
      "SPARQL=ask where{dbr:Campbell's_Kingdom dbo:starring dbr:Moon_Over_Las_Vegas }\n",
      "\n",
      "Row 78787:\n",
      "NL=How many seasons did canada's got talent have ?\n",
      "SPARQL=select count(*) as ?x where{dbr:Canada's_Got_Talent dbo:numberOfSeasons ?x }\n",
      "\n",
      "Row 99663:\n",
      "NL=Is ss american the maiden voyage of rms alcantara ?\n",
      "SPARQL=ask where{dbr:RMS_Alcantara_(1913) dbo:maidenVoyage dbr:SS_American_(1895) }\n",
      "\n",
      "Row 76858:\n",
      "NL=What is the average class size of greenwood high international school and moeller high school ?\n",
      "SPARQL=select ?x where{dbr:Greenwood_High_International_School dbo:averageClassSize ?x . dbr:Moeller_High_School dbo:averageClassSize ?x }\n",
      "\n",
      "Row 88234:\n",
      "NL=What is the area of klallam language's spoken in ?\n",
      "SPARQL=select ?x where{dbr:Klallam_language dbo:spokenIn ?x1 . ?x1 dbo:areaWater ?x }\n",
      "\n",
      "Row 5423:\n",
      "NL=Does rodrigo bentancur have height ?\n",
      "SPARQL=ask where{dbr:Rodrigo_Bentancur dbo:height ?x }\n",
      "\n",
      "Row 28562:\n",
      "NL=What is the OMIM id of interleukin-18 receptor as well as interleukin-27 receptor ?\n",
      "SPARQL=select ?x where{dbr:Interleukin-18_receptor dbo:omim ?x . dbr:Interleukin-27_receptor dbo:omim ?x }\n",
      "\n",
      "Row 22164:\n",
      "NL=Did jon koznick really have a residence on earth ?\n",
      "SPARQL=ask where{dbr:Jon_Koznick dbo:residence ?x }\n",
      "\n",
      "Row 51738:\n",
      "NL=What are metros within emirate of umm al quwain ?\n",
      "SPARQL=select ?x where{dbr:Emirate_of_Umm_Al_Quwain dbo:areaMetro ?x }\n",
      "\n"
     ]
    }
   ],
   "source": [
    "for index, row in df.sample(n=10).iterrows():\n",
    "    print(f\"Row {index}:\\nNL={row['nl_question']}\\nSPARQL={row['sparql_query']}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "7737f987",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['select ?x where{dbr:2003_MLS_All-Star_Game dbo:followingEvent ?x . dbr:Soccer_Bowl:2016 dbo:followingEvent ?x }',\n",
       " 'select ?x where{dbr:West_End_Blues dbo:recordDate ?x . dbr:The_Super_Bowl:Shuffle dbo:recordDate ?x }',\n",
       " 'select ?x where{dbr:Howl:(song) dbo:artist ?x1 . ?x1 dbo:wikiPageID ?x }',\n",
       " 'select ?x where{dbr:Captain_Spaulding_(Rob_Zombie_character) dbo:portrayer ?x . dbr:Artemis_Fowl:II dbo:portrayer ?x }',\n",
       " 'select ?x where{dbr:Sun_Bowl:(stadium) dbo:tenant ?x }',\n",
       " 'select ?x where{dbr:The_Super_Bowl:Shuffle dbo:recordDate ?x . dbr:Cheek_to_Cheek dbo:recordDate ?x }',\n",
       " 'ask where{dbr:Blood_Bowl:(2009_video_game) dbo:publisher ?x }']"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "search_strings = ['owl:']\n",
    "df[df['sparql_query'].apply(lambda x: any(s in x for s in search_strings))]['sparql_query'].to_list()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "83054e33",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>nl_question</th>\n",
       "      <th>sparql_query</th>\n",
       "      <th>prompt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3382376</td>\n",
       "      <td>How many ICD9 did friedreich's ataxia have ?</td>\n",
       "      <td>select count(*) as ?x where{dbr:Friedreich's_a...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many ICD9 d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2559914</td>\n",
       "      <td>What was the faculty size of destrehan high sc...</td>\n",
       "      <td>select ?x where{dbr:Destrehan_High_School dbo:...</td>\n",
       "      <td># write a SPARQL query for:\\n# What was the fa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2990831</td>\n",
       "      <td>Does adventist girls high school have any over...</td>\n",
       "      <td>ask where{dbr:Adventist_Girls_High_School dbo:...</td>\n",
       "      <td># write a SPARQL query for:\\n# Does adventist ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1637967</td>\n",
       "      <td>Did aliens area have one last publication date ?</td>\n",
       "      <td>ask where{dbr:Aliens_Area dbo:lastPublicationD...</td>\n",
       "      <td># write a SPARQL query for:\\n# Did aliens area...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1507546</td>\n",
       "      <td>Did bridget jones: the edge of reason have a m...</td>\n",
       "      <td>ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...</td>\n",
       "      <td># write a SPARQL query for:\\n# Did bridget jon...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99995</th>\n",
       "      <td>7260453</td>\n",
       "      <td>What is the population density of southern yuk...</td>\n",
       "      <td>select ?x where{dbr:Southern_Yukaghir_language...</td>\n",
       "      <td># write a SPARQL query for:\\n# What is the pop...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99996</th>\n",
       "      <td>6784536</td>\n",
       "      <td>Is washington county city a type of mitchell c...</td>\n",
       "      <td>ask where{dbr:Mitchell_County,_North_Carolina ...</td>\n",
       "      <td># write a SPARQL query for:\\n# Is washington c...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99997</th>\n",
       "      <td>3733762</td>\n",
       "      <td>How many married couples did bernardine dohrn ...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Bernardine_Doh...</td>\n",
       "      <td># write a SPARQL query for:\\n# How many marrie...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99998</th>\n",
       "      <td>7637742</td>\n",
       "      <td>What are the battle of magdala and battle of ș...</td>\n",
       "      <td>select ?x where{dbr:Battle_of_Magdala dbo:resu...</td>\n",
       "      <td># write a SPARQL query for:\\n# What are the ba...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99999</th>\n",
       "      <td>5249851</td>\n",
       "      <td>Did the falu red have a red coordinate in the ...</td>\n",
       "      <td>ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...</td>\n",
       "      <td># write a SPARQL query for:\\n# Did the falu re...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100000 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         index                                        nl_question  \\\n",
       "0      3382376       How many ICD9 did friedreich's ataxia have ?   \n",
       "1      2559914  What was the faculty size of destrehan high sc...   \n",
       "2      2990831  Does adventist girls high school have any over...   \n",
       "3      1637967   Did aliens area have one last publication date ?   \n",
       "4      1507546  Did bridget jones: the edge of reason have a m...   \n",
       "...        ...                                                ...   \n",
       "99995  7260453  What is the population density of southern yuk...   \n",
       "99996  6784536  Is washington county city a type of mitchell c...   \n",
       "99997  3733762  How many married couples did bernardine dohrn ...   \n",
       "99998  7637742  What are the battle of magdala and battle of ș...   \n",
       "99999  5249851  Did the falu red have a red coordinate in the ...   \n",
       "\n",
       "                                            sparql_query  \\\n",
       "0      select count(*) as ?x where{dbr:Friedreich's_a...   \n",
       "1      select ?x where{dbr:Destrehan_High_School dbo:...   \n",
       "2      ask where{dbr:Adventist_Girls_High_School dbo:...   \n",
       "3      ask where{dbr:Aliens_Area dbo:lastPublicationD...   \n",
       "4      ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...   \n",
       "...                                                  ...   \n",
       "99995  select ?x where{dbr:Southern_Yukaghir_language...   \n",
       "99996  ask where{dbr:Mitchell_County,_North_Carolina ...   \n",
       "99997  select count(*) as ?x where{dbr:Bernardine_Doh...   \n",
       "99998  select ?x where{dbr:Battle_of_Magdala dbo:resu...   \n",
       "99999  ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...   \n",
       "\n",
       "                                                  prompt  \n",
       "0      # write a SPARQL query for:\\n# How many ICD9 d...  \n",
       "1      # write a SPARQL query for:\\n# What was the fa...  \n",
       "2      # write a SPARQL query for:\\n# Does adventist ...  \n",
       "3      # write a SPARQL query for:\\n# Did aliens area...  \n",
       "4      # write a SPARQL query for:\\n# Did bridget jon...  \n",
       "...                                                  ...  \n",
       "99995  # write a SPARQL query for:\\n# What is the pop...  \n",
       "99996  # write a SPARQL query for:\\n# Is washington c...  \n",
       "99997  # write a SPARQL query for:\\n# How many marrie...  \n",
       "99998  # write a SPARQL query for:\\n# What are the ba...  \n",
       "99999  # write a SPARQL query for:\\n# Did the falu re...  \n",
       "\n",
       "[100000 rows x 4 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def format_prompt(row):\n",
    "    nl_q = row['nl_question']\n",
    "    prompt = \"# write a SPARQL query for:\\n\" + \\\n",
    "                  f\"# {nl_q}\\n\\n\" + \\\n",
    "                  \"# use following prefixes:\\n\" + \\\n",
    "                  \"PREFIX dbr: <http://dbpedia.org/resource/>\\n\" + \\\n",
    "                  \"PREFIX dbo: <http://dbpedia.org/ontology/>\"\n",
    "    return prompt\n",
    "\n",
    "df['prompt'] = df.apply(format_prompt, axis=1)\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "caf7d776",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# write a SPARQL query for:\n",
      "# How many drivers did 1951 pescara grand prix have as their driver ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the band of cgmp-dependent protein kinase and krt75 ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the neighboring municipality of brienz/brinzauls ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# How are seattle credit union and fondinvest capital linked ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# How many selection did george nelson have ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is spain wine region of grenache blanc/grenache blanc ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# How many date use did bricktown canal have ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Who is derek forbort draft team of robbie neale ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Which alma mater of alison butler's academic advisor has influenced the University ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the owner of hms cardiff's homeport ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "==================================================\n"
     ]
    }
   ],
   "source": [
    "for i, row in df.sample(n=10).iterrows():\n",
    "    print(row['prompt'], '\\n'+'='*50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ca3e5d43",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>prompt</th>\n",
       "      <th>completion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td># write a SPARQL query for:\\n# How many ICD9 d...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Friedreich's_a...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td># write a SPARQL query for:\\n# What was the fa...</td>\n",
       "      <td>select ?x where{dbr:Destrehan_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td># write a SPARQL query for:\\n# Does adventist ...</td>\n",
       "      <td>ask where{dbr:Adventist_Girls_High_School dbo:...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td># write a SPARQL query for:\\n# Did aliens area...</td>\n",
       "      <td>ask where{dbr:Aliens_Area dbo:lastPublicationD...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td># write a SPARQL query for:\\n# Did bridget jon...</td>\n",
       "      <td>ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99995</th>\n",
       "      <td># write a SPARQL query for:\\n# What is the pop...</td>\n",
       "      <td>select ?x where{dbr:Southern_Yukaghir_language...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99996</th>\n",
       "      <td># write a SPARQL query for:\\n# Is washington c...</td>\n",
       "      <td>ask where{dbr:Mitchell_County,_North_Carolina ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99997</th>\n",
       "      <td># write a SPARQL query for:\\n# How many marrie...</td>\n",
       "      <td>select count(*) as ?x where{dbr:Bernardine_Doh...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99998</th>\n",
       "      <td># write a SPARQL query for:\\n# What are the ba...</td>\n",
       "      <td>select ?x where{dbr:Battle_of_Magdala dbo:resu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99999</th>\n",
       "      <td># write a SPARQL query for:\\n# Did the falu re...</td>\n",
       "      <td>ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100000 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                  prompt  \\\n",
       "0      # write a SPARQL query for:\\n# How many ICD9 d...   \n",
       "1      # write a SPARQL query for:\\n# What was the fa...   \n",
       "2      # write a SPARQL query for:\\n# Does adventist ...   \n",
       "3      # write a SPARQL query for:\\n# Did aliens area...   \n",
       "4      # write a SPARQL query for:\\n# Did bridget jon...   \n",
       "...                                                  ...   \n",
       "99995  # write a SPARQL query for:\\n# What is the pop...   \n",
       "99996  # write a SPARQL query for:\\n# Is washington c...   \n",
       "99997  # write a SPARQL query for:\\n# How many marrie...   \n",
       "99998  # write a SPARQL query for:\\n# What are the ba...   \n",
       "99999  # write a SPARQL query for:\\n# Did the falu re...   \n",
       "\n",
       "                                              completion  \n",
       "0      select count(*) as ?x where{dbr:Friedreich's_a...  \n",
       "1      select ?x where{dbr:Destrehan_High_School dbo:...  \n",
       "2      ask where{dbr:Adventist_Girls_High_School dbo:...  \n",
       "3      ask where{dbr:Aliens_Area dbo:lastPublicationD...  \n",
       "4      ask where{dbr:Bridget_Jones:_The_Edge_of_Reaso...  \n",
       "...                                                  ...  \n",
       "99995  select ?x where{dbr:Southern_Yukaghir_language...  \n",
       "99996  ask where{dbr:Mitchell_County,_North_Carolina ...  \n",
       "99997  select count(*) as ?x where{dbr:Bernardine_Doh...  \n",
       "99998  select ?x where{dbr:Battle_of_Magdala dbo:resu...  \n",
       "99999  ask where{dbr:Falu_red dbo:rgbCoordinateGreen ...  \n",
       "\n",
       "[100000 rows x 2 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.DataFrame({\n",
    "    'prompt': df['prompt'].to_list(),\n",
    "    'completion': df['sparql_query'].to_list()\n",
    "})\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "fd55ca99",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "# write a SPARQL query for:\n",
      "# What is the death place of georgina gascoyne-cecil's spouse ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Georgina_Gascoyne-Cecil,_Marchioness_of_Salisbury dbo:spouse ?x1 . ?x1 dbo:deathPlace ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the related of ellen clacy's death place ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Ellen_Clacy dbo:deathPlace ?x1 . ?x1 dbo:related ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# How many merged with left liberals did they have ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select count(*) as ?x where{dbr:Left_Liberals_(Greece) dbo:mergedWith ?x1 . ?x1 dbo:mergedWith ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the known for of arno nadel's death place ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Arno_Nadel dbo:deathPlace ?x1 . ?x1 dbo:knownFor ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is west line track length of rail transport in vatican city ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "ask where{dbr:Rail_transport_in_Vatican_City dbo:trackLength dbr:West_Line,_Chennai_Suburban } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# Is mayals an llanelieu's principal area ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "ask where{dbr:Llanelieu dbo:principalArea dbr:Mayals_(electoral_ward) } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the has abstract of marginal mandibular branch of the facial nerve's branch from ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Marginal_mandibular_branch_of_the_facial_nerve dbo:branchFrom ?x1 . ?x1 dbo:abstract ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What is the subdivision of big tom's located in the area ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Big_Tom_(New_York) dbo:locatedInArea ?x1 . ?x1 dbo:subdivision ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# What's the length of john rogers's birth place ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:John_Rogers_(cricketer,_born_1858) dbo:birthPlace ?x1 . ?x1 dbo:length ?x } \n",
      "==================================================\n",
      "# write a SPARQL query for:\n",
      "# How many employees are there at hongkong electric company and nagashima ohno & tsunematsu ?\n",
      "\n",
      "# use following prefixes:\n",
      "PREFIX dbr: <http://dbpedia.org/resource/>\n",
      "PREFIX dbo: <http://dbpedia.org/ontology/> \n",
      "\n",
      "select ?x where{dbr:Nagashima_Ohno_&_Tsunematsu dbo:numberOfEmployees ?x . dbr:Hongkong_Electric_Company dbo:numberOfEmployees ?x } \n",
      "==================================================\n"
     ]
    }
   ],
   "source": [
    "for i, row in df.sample(n=10).iterrows():\n",
    "    print(row['prompt'], '\\n')\n",
    "    print(row['completion'], '\\n'+'='*50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ca375eba",
   "metadata": {},
   "outputs": [],
   "source": [
    "from sklearn.model_selection import train_test_split\n",
    "\n",
    "train, test = train_test_split(df, test_size=0.3, random_state=42)\n",
    "\n",
    "train.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/prompt_tuning/nspm_100k_train.csv\", index=False)\n",
    "test.to_csv(\"/home/mehrzad/repos/mehrz/dbpedia/data/prompt_tuning/nspm_100k_test.csv\", index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8957ff4",
   "metadata": {},
   "source": [
    "#\n",
    "## QALD9-plus"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "8df2f456",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'id': '1',\n",
       " 'question': [{'language': 'en', 'string': 'List all boardgames by GMT.'},\n",
       "  {'language': 'de', 'string': 'Liste die Brettspiele von GMT auf.'},\n",
       "  {'language': 'de', 'string': 'Zeige mir alle Brettspiele von GMT.'},\n",
       "  {'language': 'ru', 'string': 'Перечислите все игры GMT.'},\n",
       "  {'language': 'lt', 'string': 'Išvardinkite visus stalo žaidimus pagal GMT.'},\n",
       "  {'language': 'uk', 'string': 'Перерахуйте всі ігри GMT.'},\n",
       "  {'language': 'lt', 'string': 'Išvardykite visus GMT žaidimus.'},\n",
       "  {'language': 'fr', 'string': 'Listez tous les jeux de société de GMT.'},\n",
       "  {'language': 'es',\n",
       "   'string': '¿Qué juegos de mesa fueron hechos por GMT?',\n",
       "   'keywords': 'juego de mesa ,  GMT '}],\n",
       " 'query': {'sparql': 'PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }'},\n",
       " 'answers': [{'head': {'link': [], 'vars': ['uri']},\n",
       "   'results': {'bindings': [{'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Chandragupta_(board_game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Fields_of_Fire_(game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Sword_of_Rome'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Paths_of_Glory_(board_game)'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Commands_&_Colors:_Ancients'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Labyrinth:_The_War_on_Terror,_2001_–_%3F'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': 'http://dbpedia.org/resource/Twilight_Struggle'}},\n",
       "     {'uri': {'type': 'uri',\n",
       "       'value': \"http://dbpedia.org/resource/Washington's_War\"}}]}}]}"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import json\n",
    "\n",
    "with open('data/qald_9_plus_train_dbpedia.json', 'r') as f:\n",
    "    qald_9_plus_data = json.load(f)\n",
    "    \n",
    "qald_9_plus_data['questions'][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "2e3e04c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "List all boardgames by GMT.\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      " SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }\n"
     ]
    }
   ],
   "source": [
    "# extracting pairs of question/sparql    \n",
    "    \n",
    "english_questions, sparql_queries =[],[]\n",
    "for data in qald_9_plus_data['questions']:\n",
    "    english_questions.append(\n",
    "        next((item['string'] for item in data['question'] if item['language'] == 'en'), None)\n",
    "    )\n",
    "    sparql_queries.append(data['query']['sparql'])\n",
    "    \n",
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[0])\n",
    "print('\\n', sparql_queries[0].replace(\">\", '>\\n'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "83b09086",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "Give me all Danish films.\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      " SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[10])\n",
    "print('\\n', sparql_queries[10].replace(\">\", '>\\n'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "691c6c65",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "408 pairs extracted from train set:  \n",
      "\n",
      "Who wrote the book The pillars of the Earth?\n",
      "\n",
      " PREFIX dbo: <http://dbpedia.org/ontology/>\n",
      " PREFIX res: <http://dbpedia.org/resource/>\n",
      " PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      " SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print(f'{len(english_questions)} pairs extracted from train set: ', \"\\n\")\n",
    "print(english_questions[20])\n",
    "print('\\n', sparql_queries[20].replace(\">\", '>\\n'))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "dbpedia-env",
   "language": "python",
   "name": "dbpedia"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
